roblatour/ESP32TimeServer/PlatformIO/Projects/esp32TimeServer/src/ESP32TimeServer.cpp
// Rob Latour, 2023
// License: MIT
// https://github.com/roblatour
//
// This program's key setting can be viewed/updated in the file:
//      ESP32TimeServerKeySettings.h
//
// https://time.is may be used a reference point to confirm your computer's date/time accuracy
//

// board: Olimex ESP32 POE ISO

// last updated July 6, 2023

#include <ETH.h>
#include <Timezone.h> // https://github.com/khoih-prog/Timezone_Generic
#include <ESP32Time.h>
#include <SoftwareSerial.h>
#include <SparkFun_u-blox_GNSS_v3.h> // https://github.com/sparkfun/SparkFun_u-blox_GNSS_v3
#include <LiquidCrystal_I2C.h>       // https://github.com/johnrickman/LiquidCrystal_I2C
#include "ESP32TimeServerKeySettings.h"

// ESP32Time real time clock
ESP32Time rtc(0);

// Ethernet
bool eth_connected = false;
bool eth_got_IP = false;
String ip = "";

// GPS
SFE_UBLOX_GNSS_SERIAL gps;
SoftwareSerial GPSDevice(RXPin, TXPin);
volatile bool ppsFlag; // GPS one-pulse-per-second flag

// LCD Display
LiquidCrystal_I2C lcd(lcdI2CAddress, lcdColumns, lcdRows);
String fullyBlankLine = "";

// TimeZone
TimeChangeRule *tcr;

// NTP port and packet buffer
#define NTP_PORT 123
#define NTP_PACKET_SIZE 48
byte packetBuffer[NTP_PACKET_SIZE];
WiFiUDP Udp;

// Constants and global variables
const unsigned long oneSecond_inMilliseconds = 1000;                              // one second in milliseconds
const unsigned long oneMinute_inMilliseconds = 60 * oneSecond_inMilliseconds;     // one minute in milliseconds
const unsigned long thirtyMinutes_inMilliseconds = 30 * oneMinute_inMilliseconds; // 30 minutes in milliseconds
const long oneSecond_inMicroseconds_L = 1000000;                                  // one second in microseconds (signed long)
const double oneSecond_inMicroseconds_D = 1000000.0;                              // one second in microseconds (double)
                                                                                  //
const unsigned long periodicTimeRefreshPeriod = thirtyMinutes_inMilliseconds;     // how often the system's real time clock is refreshed with GPS data
const time_t safeguardThresholdInSeconds = 1;                                     // used to ensure a GPS time refresh is only performed if the difference between the old and new times is this many seconds or less
volatile bool SafeGuardTripped = false;                                           // used to ensure the time isn't changed beyond that which would reasonably be expected within the periodicTimeRefreshPeriod
                                                                                  //
volatile bool theTimeSettingProcessIsUnderway;                                    // signifies when the time is being set / refreshed

//
SemaphoreHandle_t mutex;         // used to ensure an NTP request results are not impacted by the process that refreshes the time
                                 //
TaskHandle_t taskHandle0 = NULL; // task handle for updating the display
TaskHandle_t taskHandle1 = NULL; // task handle for setting/refreshing the time

//**************************************************************************************************************************

void setupSerial()
{

  if (debugIsOn)
  {

    Serial.begin(SerialMonitorSpeed);

    for (int i = 0; i < 10; i++)
      Serial.println("");
  };
}

void turnOffWifiAndBluetooth()
{

  // wifi and bluetooth aren't needed so turn them off
  WiFi.mode(WIFI_OFF);
  btStop();
}

void setupButton()
{

  pinMode(UpTimePin, INPUT_PULLUP);
};

void display(uint8_t row, String msg, bool writeToSerialMonitor = true)
{

  String displayLine = msg + fullyBlankLine; // adding the fully blank line here clears the remnants of previously displayed information
  displayLine = displayLine.substring(0, 20);

  lcd.setCursor(0, row);
  lcd.print(displayLine);

  if (debugIsOn && writeToSerialMonitor)
    Serial.println(displayLine);
}

void setupDisplay()
{

  lcd.begin(lcdColumns, lcdRows);
  lcd.init();
  lcd.backlight();
  lcd.noAutoscroll();
  lcd.noCursor();
  lcd.clear();
  lcd.home();

  for (int i = 0; i < lcdColumns; i++)
    fullyBlankLine.concat(" ");

  display(0, "ESP32 Time Server", false);
}

void GetAdjustedDateAndTimeStrings(time_t UTC_Time, String &dateString, String &timeString)
{

  // adjust utc time to local time
  time_t now_Local_Time = myTZ.toLocal(UTC_Time, &tcr);

  // format dateLine

  dateString = String(year(now_Local_Time));

  dateString.concat("-");

  if (month(now_Local_Time) < 10)
    dateString.concat("0");

  dateString.concat(String(month(now_Local_Time)));

  dateString.concat("-");

  if (day(now_Local_Time) < 10)
    dateString.concat("0");

  dateString.concat(String(day(now_Local_Time)));

  // format timeLine

  timeString = String(hourFormat12(now_Local_Time));

  timeString.concat(":");

  if (minute(now_Local_Time) < 10)
    timeString.concat("0");

  timeString.concat(String(minute(now_Local_Time)));

  timeString.concat(":");

  if (second(now_Local_Time) < 10)
    timeString.concat("0");

  timeString.concat(String(second(now_Local_Time)));

  if (isAM(now_Local_Time))
    timeString.concat(" AM ");
  else
    timeString.concat(" PM ");
  
  if (displayTimeZone)
    timeString.concat(tcr -> abbrev);
};

String GetUpTime()
{

  unsigned long ms = millis();

  const int oneSecond = 1000;
  const int oneMinute = oneSecond * 60;
  const int oneHour = oneMinute * 60;
  const int oneDay = oneHour * 24;

  int numberOfDays = ms / oneDay;
  ms = ms - numberOfDays * oneDay;

  int numberOfHours = ms / oneHour;
  ms = ms - numberOfHours * oneHour;

  int numberOfMinutes = ms / oneMinute;
  ms = ms - numberOfMinutes * oneMinute;

  int numberOfSeconds = ms / oneSecond;

  String returnValue = "";

  char buffer[21];

  sprintf(buffer, "%d %02d:%02d:%02d", numberOfDays, numberOfHours, numberOfMinutes, numberOfSeconds);

  returnValue = String(buffer);
  return returnValue;
}

bool checkUpTimeRequest()
{

  bool returnValue = false;

  if (digitalRead(UpTimePin) == 0)
  {

