roblatour/ESP32TimeServer/PlatformIO/Projects/esp32TimeServer/src/ESP32TimeServer.cpp
    delay(10); // weed out false positives caused by debounce

    if (digitalRead(UpTimePin) == 0)
    {

      returnValue = true;
    };
  };

  return returnValue;
}

void updateTheDisplay(void *parameter)
{

  const int programNameRow = 0;   // the LCD row on which the program name will be displayed
                                  //
                                  // when an NTP request is not being processed:
  const int dateRow = 1;          // the LCD row on which the current date in local time will be displayed
  const int timeRow = 2;          // the LCD row on which the current time in local time will be displayed
  const int ipAddressRow = 3;     // the LCD row on which the IP Address of this device will be displayed
                                  //
                                  // when an NTP request is being processed:
  const int upTimeRequestRow = 1; // the LCD row on which the up time request message will be displayed
  const int upTimeResultsRow = 2; // the LCD row on which the up time will be displayed
  const int upTimeExplainRow = 3; // the LCD row on which a blank line will appear when displaying the up time

  int previousTopLineMessage = -1;
  int previousSecond = -1;

  static int displayUpTimeSecondsCounter = 0; // used to keep the Up Time display active

  bool anUptimeRequestHadBeenMade = false;

  while (true)
  {

    if (second() != previousSecond)
    {

      previousSecond = second();

      if (checkUpTimeRequest())
        displayUpTimeSecondsCounter = displayUpTimeSecondsToStayActive;

      // Display the top line message (when it changes)
      //
      // Meanings of the top line message are:
      //
      //   the server is running                                             ESP32 Time Server
      //
      //   the server is running and a time refresh is underway              ESP32 Time Server *
      //
      //   the server is running and a time refresh is underway              ESP32 Time Server **
      //   but the server denied the last time refresh as it
      //   was outside the safeguard range
      //
      //   the user has pressed the button to request the server's up time   ESP32 Time Server's

      int RequiredTopLineMessage;

      if (displayUpTimeSecondsCounter > 0)
        RequiredTopLineMessage = 4;
      else if (SafeGuardTripped)
        RequiredTopLineMessage = 3;
      else if (theTimeSettingProcessIsUnderway)
        RequiredTopLineMessage = 2;
      else
        RequiredTopLineMessage = 1;

      if (RequiredTopLineMessage != previousTopLineMessage)
      {

        String TopLineMessage;
        if (RequiredTopLineMessage == 1)
          TopLineMessage = "ESP32 Time Server";
        else if (RequiredTopLineMessage == 2)
          TopLineMessage = "ESP32 Time Server *";
        else if (RequiredTopLineMessage == 3)
          TopLineMessage = "ESP32 Time Server **";
        else if (RequiredTopLineMessage == 4)
          TopLineMessage = "ESP32 Time Server's";

        display(programNameRow, TopLineMessage, false);

        previousTopLineMessage = RequiredTopLineMessage;
      };

      // If an NTP request is underway

      // Display the IP address of the request
      // also show system uptime

      if (displayUpTimeSecondsCounter > 0)
      {
        display(upTimeRequestRow, "up time is", false);

        // centre up time results on the display
        String ws = GetUpTime();
        int padLeftSpacesNeeded = (lcdColumns - ws.length()) / 2;
        String padLeft = fullyBlankLine.substring(0, padLeftSpacesNeeded);
        ws = padLeft + ws;
        display(upTimeResultsRow, ws, false);

        display(upTimeExplainRow, " days hrs:mins:secs", false);
        anUptimeRequestHadBeenMade = true;

        Serial.println(displayUpTimeSecondsCounter);
        displayUpTimeSecondsCounter--;
      }
      else
      {

        // Display the date and time

        static int lastSecond = -1;
        static int lastDay = -1;

        // Get the time
        time_t now_UTC_Time = rtc.getEpoch();

        // if an update request had previously been made, then both the date and time lines will need to be refreshed,
        // otherwise:
        //   if the second hasn't changed since the last time it was displayed, then the display doesn't need to be updated further

        int thisSecond = second(now_UTC_Time);
        if ((thisSecond != lastSecond) || anUptimeRequestHadBeenMade)
        {

          lastSecond = thisSecond;

          // get the formated date and time as seperate strings

          String dateLine = "";
          String timeLine = "";
          GetAdjustedDateAndTimeStrings(now_UTC_Time, dateLine, timeLine);

          // update the time line on the display
          display(timeRow, timeLine, false);

          // if the date hasn't changed  since the last time it was displayed, then the display doesn't need to be updated

          int thisDay = day(now_UTC_Time);
          if ((thisDay != lastDay) || anUptimeRequestHadBeenMade)
          {

            // update the date line on the display
            display(dateRow, dateLine, false);
            lastDay = thisDay;
          };

          // if an uptime request had been made restore the ip address line
          if (anUptimeRequestHadBeenMade)
            display(ipAddressRow, ip);
        };

        vTaskDelay(975 / portTICK_PERIOD_MS);
      };
    };
  };
}

void startAnOngoingTaskToUpdateTheDisplayEverySecond()
{

  xTaskCreatePinnedToCore(
      updateTheDisplay,     // Function that should be called
      "Update the display", // Name of the task (for debugging)
      3000,                 // Stack size (bytes)
      NULL,                 // Parameter to pass
      10,                   // Task priority
      &taskHandle0,         // Task handle
      0                     // use core 0 to split the load with setDateAndTimeFromGPS
  );
}

bool setTheGPSBaudRate(int gpsBaud, int maxAattemptsToChangeTheBaudRate)
{

  bool buadRateNeedsToBeSet = true;
  int attemptsToChangeTheBaudRate = 0;

  while ((buadRateNeedsToBeSet) && (attemptsToChangeTheBaudRate < maxAattemptsToChangeTheBaudRate))
  {

