roblatour/ESP32TimeServer/PlatformIO/Projects/esp32TimeServer/src/ESP32TimeServer.cpp
    if (debugIsOn)
    {
      Serial.println("Attempt " + String(int(attemptsToChangeTheBaudRate + 1)) + " of " + String(maxAattemptsToChangeTheBaudRate) + ":");
      Serial.println("  Set baud rate to " + String(gpsBaud));
    }

    GPSDevice.begin(gpsBaud);
    delay(100);
    if (gps.begin(GPSDevice))
    {
      buadRateNeedsToBeSet = false;
    }
    else
    {

      if (debugIsOn)
        Serial.println("  Could not connect at a buad rate of " + String(gpsBaud) + ", now trying 9600 baud");

      GPSDevice.begin(9600);

      if (gps.begin(GPSDevice))
      {
        if (debugIsOn)
          Serial.println("  Connected at 9600 baud, switching to " + String(gpsBaud) + " baud");
        gps.setSerialRate(gpsBaud);
        delay(100);
      }
      else
      {
        if (debugIsOn)
        {
          Serial.println("  Could not connect at a buad rate of 9600 baud");
          if ((attemptsToChangeTheBaudRate + 1) != maxAattemptsToChangeTheBaudRate)
            Serial.println("  will try again");
        };
        // gps.factoryDefault();
        delay(2000); // Wait a bit before trying again to limit the Serial output
      };

      attemptsToChangeTheBaudRate++;
    };
  };

  //   gps.saveConfiguration();   // Optionally: if when you are testing this sketch the buad rate is constantly being
  //                              // successfully set at the desired rate (38400) then you can uncomment this line of code
  //                              // so that the GPS's configuration will default to starting at 34800 rather than 9600.
  //                              // However, as this will only need to be done once this line of code should then be
  //                              // commented back out for subsequent runs.  This procedure is entirely optional.

  if (debugIsOn)
  {
    Serial.println("");
    if (buadRateNeedsToBeSet)
    {
      Serial.println("The baud rate on the GPS could not be set to " + String(gpsBaud));
    }
    else
    {
      Serial.println("  Baud rate set to " + String(gpsBaud));
    };
    Serial.println("");
  };

  return !buadRateNeedsToBeSet;
};

void setupGPS()
{

  if (!setTheGPSBaudRate(GPSBaud, 10))
  {
    display(1, "Something is wrong");
    display(2, "couldn't communicate");
    display(3, "with the GPS device.");
    // Freeze here
    while (true)
      ;
  };

  gps.setI2COutput(0);
  gps.setUART1Output(COM_TYPE_UBX); // Set the UART port to output UBX only
  gps.setUART2Output(0);

  display(1, "Waiting for GPS fix");

  unsigned long nextCheck = millis() + oneSecond_inMilliseconds;
  byte fixType;

  bool continueWaitingForAFix = true;
  while (continueWaitingForAFix)
  {

    // only check once a second
    if (millis() > nextCheck)
    {

      nextCheck = millis() + oneSecond_inMilliseconds;

      fixType = gps.getFixType();
      if ((fixType > 0) && (fixType < 6))
      {

        String msg;
        switch (int(fixType))
        {
        case 0:
          msg = "No fix";
          break;
        case 1:
          msg = "Dead reckoning";
          break;
        case 2:
          msg = "2D";
          break;
        case 3:
          msg = "3D";
          break;
        case 4:
          msg = "GNSS + Dead reckoning";
          break;
        case 5:
          msg = "Date and time";
          break;
        };
        display(1, "GPS fix obtained");
        display(2, msg);
        delay(5000);

        continueWaitingForAFix = false;
      };
    };
  };
}

void setDateAndTimeFromGPS(void *parameter)
{

  static bool thisIsTheFirstTimeSetBeingMadeAtStartup = true;

  /// used below to ensure a GPS time refresh if is only performed if the difference between the old and new times is reasonable for the periodicTimeRefreshPeriod
  const time_t safeguardThresholdHigh = safeguardThresholdInSeconds;
  const time_t safeguardThresholdLow = -1 * safeguardThresholdInSeconds;

  time_t candidateDateAndTime;

  if (debugIsOn)
    Serial.println("Start setDateAndTimeFromGPS task");

  while (true)
  {

    theTimeSettingProcessIsUnderway = true;

    // wait for the ppsFlag to be raised at the start of the 1st second
    ppsFlag = false;
    while (!ppsFlag)
      ;

    if (gps.getPVT()) // get latest time data (to reflect the start of the next second)
    {

      if (gps.getDateValid() && gps.getTimeValid()) // make sure the date and time are valid (in that values are populated)
      {

        struct tm wt;
        wt.tm_year = gps.getYear();
        wt.tm_mon = gps.getMonth();
        wt.tm_mday = gps.getDay();
        wt.tm_hour = gps.getHour();
        wt.tm_min = gps.getMinute();
        wt.tm_sec = gps.getSecond();

        if ((wt.tm_year > 2022) && (wt.tm_mon > 0) && (wt.tm_mon < 13) && (wt.tm_mday > 0) && (wt.tm_mday < 32) && (wt.tm_hour < 24) && (wt.tm_min < 60) && (wt.tm_sec < 61)) // make sure the values are within reason
        {

          // set candidate time according the gps (this will be effective when the PPS flag is next raised)
          wt.tm_year -= 1900;                     // adjust year (see you again in 2036)
          wt.tm_mon -= 1;                         // adjust month (January is month 0)
          candidateDateAndTime = mktime(&wt) + 1; // not sure why the + 1 but it is

          if (debugIsOn)
            Serial.println("Candidate date and time " + String(wt.tm_year) + " " + String(wt.tm_mon) + " " + String(wt.tm_mday) + " " + String(wt.tm_hour) + " " + String(wt.tm_min) + " " + String(wt.tm_sec));

          time_t wt = candidateDateAndTime;
          time_t candiateDateAndTime_t = time(&wt);

          // give some time to ensure the PPS pin is reset
          vTaskDelay(200 / portTICK_PERIOD_MS);

          // wait for the PPS flag to be raised (signifying the true start of the candidate time)
          ppsFlag = false;
          while (!ppsFlag)
            ;

          unsigned long pegProcessingAdjustmentStartTime = micros();

          // at this point:
          // apply a sanity check; the current rtc time and the candidate time just taken from the gps readings which will be used to refresh the current rtc should be within a second of each other (safeguardThresholdInSeconds)
          // if the sanity check fails, do not set the time and raise a Safeguard flag which be used to update the display to show the user the latest time refresh failed
          // if the sanity check passes, proceed with refreshing the time and if the Safeguard flag been previously been raised then lower it

          bool SanityCheckPassed;
          time_t updateDelta;

          if (thisIsTheFirstTimeSetBeingMadeAtStartup)
          {
            SanityCheckPassed = true;
          }
          else
          {
            time_t currentRTC_t = rtc.getEpoch();
            time_t currentRTCDateAndTime_t = time(&currentRTC_t);
            updateDelta = currentRTCDateAndTime_t - candiateDateAndTime_t;
            bool SanityCheckPassed = (((updateDelta >= safeguardThresholdLow) && (updateDelta <= safeguardThresholdHigh)));
          };

