roblatour/ESP32TimeServer/PlatformIO/Projects/esp32TimeServer/src/ESP32TimeServer.cpp
          if (SanityCheckPassed)
          {

            // place a hold on (the date and time) so if an NTP request is underway in the fraction of a second this code will take, the time and date values don't change mid way through that request.
            if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE)
            {

              // set the date and time

              unsigned long pegProcessingAdjustmentEndTime = micros();
              unsigned long ProcessingAdjustment = pegProcessingAdjustmentEndTime - pegProcessingAdjustmentStartTime;

              // set the real time clock
              rtc.setTime((unsigned long)candidateDateAndTime, (int)ProcessingAdjustment);

              // release the hold
              xSemaphoreGive(mutex);

              if (debugIsOn)
              {
                Serial.print("Date and time set to ");
                String ws = rtc.getDateTime(true);
                ws.trim();
                Serial.println(ws + " (UTC)");
              };

              SafeGuardTripped = false;
              theTimeSettingProcessIsUnderway = false;
              thisIsTheFirstTimeSetBeingMadeAtStartup = false;

              // whew that was hard work but fun, lets take a break and then do it all again
              vTaskDelay(periodicTimeRefreshPeriod / portTICK_PERIOD_MS);
            }
            else
            {
              if (debugIsOn)
              {
                Serial.println("Could not refresh the time as a NTP request was underway");
                Serial.println("Will try again");
              };
            }
          }
          else
          {
            if (debugIsOn)
            {
              Serial.println("This date and time refresh failed its sanity check with a time delta of " + String(updateDelta) + " seconds");
              Serial.println("The time was not refreshed.");
              Serial.print("Date and time are ");
              String ws = rtc.getDateTime(true);
              ws.trim();
              Serial.println(ws + " (UTC)");
              Serial.println("Will try again");
            };

            SafeGuardTripped = true;
          };
        };
      };
    };
  };
};

void startAnOngoingTaskToRefreshTheDateAndTimeFromTheGPS()
{

  xTaskCreatePinnedToCore(
      setDateAndTimeFromGPS,
      "Set Date and Time from GPS",
      3000,
      NULL,
      20, // task priority must be reasonably high or the queues from which the gps data is drawn will not be adequately replenished
      &taskHandle1,
      1 // use core 1 to split the load with updateTheDisplay
  );
};

void EthEvent(WiFiEvent_t event)
{

  const int rowOfDisplayToShowStatus = 1;
  const int rowOfDisplayToShowIP = 3;

  switch (event)
  {
  case ARDUINO_EVENT_ETH_START:
    ETH.setHostname("MasterClock");
    display(rowOfDisplayToShowStatus, "Ethernet started");
    break;
  case ARDUINO_EVENT_ETH_CONNECTED:
    display(rowOfDisplayToShowStatus, "Ethernet connected");
    eth_connected = true;
    break;
  case ARDUINO_EVENT_ETH_GOT_IP:
    ip = ETH.localIP().toString();
    display(rowOfDisplayToShowIP, ip);
    eth_got_IP = true;
    eth_connected = true;
    break;
  case ARDUINO_EVENT_ETH_DISCONNECTED:
    display(rowOfDisplayToShowStatus, "Ethernet disconnect");
    eth_connected = false;
    break;
  case ARDUINO_EVENT_ETH_STOP:
    display(rowOfDisplayToShowStatus, "Ethernet stopped");
    eth_connected = false;
    break;
  default:
    break;
  }
}

void setupEitherNet()
{

  WiFi.onEvent(EthEvent);
  ETH.begin();

  while (!eth_got_IP)
    delay(1);
}

void startUDPSever()
{

  Udp.begin(NTP_PORT);
}

uint64_t getCurrentTimeInNTP64BitFormat()
{

  const uint64_t numberOfSecondsBetween1900and1970 = 2208988800;

  uint64_t clockSecondsSinceEpoch = numberOfSecondsBetween1900and1970 + (uint64_t)rtc.getEpoch();
  long clockMicroSeconds = (long)rtc.getMicros();

  // as one might infer clockMicroSeconds is in microseconds (i.e. 1 second = 1,000,000 microseconds)
  //
  // accordingly, if the clockMicroSeconds is greater than one million ...
  //   for every million that is over:
  //     add 1 (second) to clockSecondsSinceEpoch, and
  //     reduce the clockMicroSeconds by one million (microseconds)
  //
  // likewise ...
  //
  // if the clockMicroSeconds is less than zero:
  //   for every million that is under zero:
  //     subtract (second) from clockSecondsSinceEpoch, and
  //     increase the clockMicroSeconds by one million (microseconds)

  while (clockMicroSeconds > oneSecond_inMicroseconds_L)
  {
    clockSecondsSinceEpoch++;
    clockMicroSeconds -= oneSecond_inMicroseconds_L;
  };

  while (clockMicroSeconds < 0L)
  {
    clockSecondsSinceEpoch--;
    clockMicroSeconds += oneSecond_inMicroseconds_L;
  };

  // for the next two lines to be clear, please see: https://tickelton.gitlab.io/articles/ntp-timestamps/

  double clockMicroSeconds_D = (double)clockMicroSeconds * (double)(4294.967296);
  uint64_t ntpts = ((uint64_t)clockSecondsSinceEpoch << 32) | (uint64_t)(clockMicroSeconds_D);

  return ntpts;
}

// send NTP reply
void sendNTPpacket(IPAddress remoteIP, int remotePort)
{

  // set the receive time to the current time
  uint64_t receiveTime_uint64_t = getCurrentTimeInNTP64BitFormat();

  // Initialize values needed to form NTP request

  // LI: 0, Version: 4, Mode: 4 (server)
  // packetBuffer[0] = 0b00100100;
  // LI: 0, Version: 3, Mode: 4 (server)
  packetBuffer[0] = 0b00011100;

  // Stratum, or type of clock
  packetBuffer[1] = 0b00000001;

  // Polling Interval
  packetBuffer[2] = 4;

  // Peer Clock Precision
  // log2(sec)
  // 0xF6 <--> -10 <--> 0.0009765625 s
  // 0xF7 <--> -9 <--> 0.001953125 s
  // 0xF8 <--> -8 <--> 0.00390625 s
  // 0xF9 <--> -7 <--> 0.0078125 s
  // 0xFA <--> -6 <--> 0.0156250 s
  // 0xFB <--> -5 <--> 0.0312500 s
  packetBuffer[3] = 0xF7;

  // 8 bytes for Root Delay & Root Dispersion
  // root delay
  packetBuffer[4] = 0;
  packetBuffer[5] = 0;
  packetBuffer[6] = 0;
  packetBuffer[7] = 0;

  // root dispersion
  packetBuffer[8] = 0;
  packetBuffer[9] = 0;
  packetBuffer[10] = 0;
  packetBuffer[11] = 0x50;

